#ifndef _RTL876X_AON_REG_H
#define _RTL876X_AON_REG_H

#include <stdint.h>

/* Auto gen based on RL6736A_REG_20210722.xlsx */

#define AON_RG0X        0x0
#define AON_RG1X        0x4
#define AON_RG2X        0x8
#define AON_RG3X        0xC
#define AON_RG4X        0x10

/* 0x0      0x4000_0000
    0       R/W AON_SWR_CORE_POW_SAW_IB         1'b0        BTAON_reg_wr
    1       R/W AON_SWR_CORE_POW_IMIR           1'b0        BTAON_reg_wr
    2       R/W AON_LDOAUX1_POW_LDO533HQ        1'b0        BTAON_reg_wr
    3       R/W AON_LDOAUX1_EN_POS              1'b0        BTAON_reg_wr
    4       R/W AON_LDOSYS_POW_HQLQ533_PC       1'b0        BTAON_reg_wr
    5       R/W AON_LDOSYS_POW_HQLQVCORE533_PC  1'b0        BTAON_reg_wr
    6       R/W AON_LDOAUX1_POS_RST_B           1'b0        BTAON_reg_wr
    7       R/W AON_LDOAUX1_POW_VREF            1'b0        BTAON_reg_wr
    8       R/W AON_LDOSYS_POW_LDO533HQ         1'b0        BTAON_reg_wr
    9       R/W AON_LDOSYS_EN_POS               1'b0        BTAON_reg_wr
    10      R/W AON_LDOSYS_POW_LDO733LQ_VCORE   1'b0        BTAON_reg_wr
    12:11   R/W AON_CHG_SEL_M2CCDFB             2'b01       BTAON_reg_wr
    13      R/W AON_LDOSYS_POS_RST_B            1'b0        BTAON_reg_wr
    14      R/W AON_LDOSYS_POW_LDOVREF          1'b0        BTAON_reg_wr
    15      R/W AON_CHG_POW_M2                  1'b0        BTAON_reg_wr
    16      R/W AON_CHG_POW_M1                  1'b0        BTAON_reg_wr
    17      R/W AON_CHG_POW_M2_DVDET            1'b0        BTAON_reg_wr
    18      R/W AON_CHG_POW_M1_DVDET            1'b0        BTAON_reg_wr
    19      R/W AON_CHG_EN_M1FON_LDO733         1'b0        BTAON_reg_wr
    20      R/W AON_CHG_EN_M2FONBUF             1'b0        BTAON_reg_wr
    21      R/W AON_CHG_EN_M2FON1K              1'b0        BTAON_reg_wr
    22      R/W AON_POW32K_32KXTAL              1'b0        BTAON_reg_wr
    23      R/W AON_POW32K_32KOSC               1'b1        BTAON_reg_wr
    24      R/W AON_MBIAS_POW_VAUDIO_DET        1'b0        BTAON_reg_wr
    25      R/W AON_MBIAS_POW_VDDCORE_DET       1'b0        BTAON_reg_wr
    26      R/W AON_MBIAS_POW_VAUX_DET          1'b0        BTAON_reg_wr
    27      R/W AON_MBIAS_POW_HV_DET            1'b0        BTAON_reg_wr
    28      R/W AON_MBIAS_POW_VBAT_DET          1'b0        BTAON_reg_wr
    29      R/W AON_MBIAS_POW_ADP_DET           1'b0        BTAON_reg_wr
    30      R/W AON_MBIAS_POW_BIAS_500nA        1'b0        BTAON_reg_wr
    31      R/W AON_MBIAS_POW_BIAS              1'b1        BTAON_reg_wr
 */
typedef union _AON_RG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_SWR_CORE_POW_SAW_IB: 1;
        uint32_t AON_SWR_CORE_POW_IMIR: 1;
        uint32_t AON_LDOAUX1_POW_LDO533HQ: 1;
        uint32_t AON_LDOAUX1_EN_POS: 1;
        uint32_t AON_LDOSYS_POW_HQLQ533_PC: 1;
        uint32_t AON_LDOSYS_POW_HQLQVCORE533_PC: 1;
        uint32_t AON_LDOAUX1_POS_RST_B: 1;
        uint32_t AON_LDOAUX1_POW_VREF: 1;
        uint32_t AON_LDOSYS_POW_LDO533HQ: 1;
        uint32_t AON_LDOSYS_EN_POS: 1;
        uint32_t AON_LDOSYS_POW_LDO733LQ_VCORE: 1;
        uint32_t AON_CHG_SEL_M2CCDFB: 2;
        uint32_t AON_LDOSYS_POS_RST_B: 1;
        uint32_t AON_LDOSYS_POW_LDOVREF: 1;
        uint32_t AON_CHG_POW_M2: 1;
        uint32_t AON_CHG_POW_M1: 1;
        uint32_t AON_CHG_POW_M2_DVDET: 1;
        uint32_t AON_CHG_POW_M1_DVDET: 1;
        uint32_t AON_CHG_EN_M1FON_LDO733: 1;
        uint32_t AON_CHG_EN_M2FONBUF: 1;
        uint32_t AON_CHG_EN_M2FON1K: 1;
        uint32_t AON_POW32K_32KXTAL: 1;
        uint32_t AON_POW32K_32KOSC: 1;
        uint32_t AON_MBIAS_POW_VAUDIO_DET: 1;
        uint32_t AON_MBIAS_POW_VDDCORE_DET: 1;
        uint32_t AON_MBIAS_POW_VAUX_DET: 1;
        uint32_t AON_MBIAS_POW_HV_DET: 1;
        uint32_t AON_MBIAS_POW_VBAT_DET: 1;
        uint32_t AON_MBIAS_POW_ADP_DET: 1;
        uint32_t AON_MBIAS_POW_BIAS_500nA: 1;
        uint32_t AON_MBIAS_POW_BIAS: 1;
    };
} AON_RG0X_TYPE;

/* 0x4      0x4000_0004
    0       R/W AON_REG1X_DUMMY1                1'h0        BTAON_reg_wr
    1       R/W AON_SWR_CORE_POW_BNYCNT_2       1'b0        BTAON_reg_wr
    2       R/W AON_LDO_DIG_POW_LDODIG          1'b0        BTAON_reg_wr
    3       R/W AON_LDO_DIG_EN_POS              1'b0        BTAON_reg_wr
    4       R/W AON_LDO_DIG_EN_LDODIG_PC        1'b0        BTAON_reg_wr
    6:5     R/W AON_XTAL_LPS_CAP_STEP           2'b01       BTAON_reg_wr
    8:7     R/W AON_XTAL_LPS_CAP_CYC            2'b00       BTAON_reg_wr
    9       R/W AON_LDO_DIG_POS_RST_B           1'b0        BTAON_reg_wr
    14:10   R/W AON_LDO_DIG_TUNE_LDODIG_VOUT    5'b10110    BTAON_reg_wr
    15      R/W AON_LDO_DIG_POW_LDODIG_VREF     1'b0        BTAON_reg_wr
    16      R/W AON_SWR_CORE_POW_ZCD_COMP_LOWIQ 1'b0        BTAON_reg_wr
    22:17   R/W AON_SWR_CORE_TUNE_BNYCNT_INI    6'b000000   BTAON_reg_wr
    23      R/W AON_SWR_CORE_POW_BNYCNT_1       1'b0        BTAON_reg_wr
    24      R/W AON_SWR_CORE_FPWM_1             1'b0        BTAON_reg_wr
    25      R/W AON_SWR_CORE_POW_OCP            1'b0        BTAON_reg_wr
    26      R/W AON_SWR_CORE_POW_ZCD            1'b0        BTAON_reg_wr
    27      R/W AON_SWR_CORE_POW_PFM            1'b0        BTAON_reg_wr
    28      R/W AON_SWR_CORE_POW_PWM            1'b0        BTAON_reg_wr
    29      R/W AON_SWR_CORE_POW_VDIV           1'b0        BTAON_reg_wr
    30      R/W AON_SWR_CORE_POW_REF            1'b0        BTAON_reg_wr
    31      R/W AON_SWR_CORE_POW_SAW            1'b0        BTAON_reg_wr
 */
typedef union _AON_RG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_REG1X_DUMMY1: 1;
        uint32_t AON_SWR_CORE_POW_BNYCNT_2: 1;
        uint32_t AON_LDO_DIG_POW_LDODIG: 1;
        uint32_t AON_LDO_DIG_EN_POS: 1;
        uint32_t AON_LDO_DIG_EN_LDODIG_PC: 1;
        uint32_t AON_XTAL_LPS_CAP_STEP: 2;
        uint32_t AON_XTAL_LPS_CAP_CYC: 2;
        uint32_t AON_LDO_DIG_POS_RST_B: 1;
        uint32_t AON_LDO_DIG_TUNE_LDODIG_VOUT: 5;
        uint32_t AON_LDO_DIG_POW_LDODIG_VREF: 1;
        uint32_t AON_SWR_CORE_POW_ZCD_COMP_LOWIQ: 1;
        uint32_t AON_SWR_CORE_TUNE_BNYCNT_INI: 6;
        uint32_t AON_SWR_CORE_POW_BNYCNT_1: 1;
        uint32_t AON_SWR_CORE_FPWM_1: 1;
        uint32_t AON_SWR_CORE_POW_OCP: 1;
        uint32_t AON_SWR_CORE_POW_ZCD: 1;
        uint32_t AON_SWR_CORE_POW_PFM: 1;
        uint32_t AON_SWR_CORE_POW_PWM: 1;
        uint32_t AON_SWR_CORE_POW_VDIV: 1;
        uint32_t AON_SWR_CORE_POW_REF: 1;
        uint32_t AON_SWR_CORE_POW_SAW: 1;
    };
} AON_RG1X_TYPE;

/* 0x8      0x4000_0008
    3:0     R/W AON_REG2X_DUMMY1                4'h0        BTAON_reg_wr
    4       R/W AON_BLE_RESTORE                 1'b0        BTAON_reg_wr
    5       R/W AON_VCORE_PC_POW_VCORE_PC_VG2   1'b1        BTAON_reg_wr
    6       R/W AON_VCORE_PC_POW_VCORE_PC_VG1   1'b1        BTAON_reg_wr
    7       R/W AON_LDO_DIG_POW_LDORET          1'b0        BTAON_reg_wr
    8       R/W AON_SWR_CORE_POW_SWR            1'b0        BTAON_reg_wr
    9       R/W AON_SWR_CORE_POW_LDO            1'b0        BTAON_reg_wr
    10      R/W AON_SWR_CORE_SEL_POS_VREFLPPFM  1'b0        BTAON_reg_wr
    11      R/W AON_SWR_CORE_FPWM_2             1'b0        BTAON_reg_wr
    19:12   R/W AON_SWR_CORE_TUNE_VDIV          8'b10001010 BTAON_reg_wr
    27:20   R/W AON_SWR_CORE_TUNE_POS_VREFPFM   8'b01101110 BTAON_reg_wr
    31:28   R/W AON_SWR_CORE_TUNE_REF_VREFLPPFM 4'b0110     BTAON_reg_wr
 */
typedef union _AON_RG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_REG2X_DUMMY1: 4;
        uint32_t AON_BLE_RESTORE: 1;
        uint32_t AON_VCORE_PC_POW_VCORE_PC_VG2: 1;
        uint32_t AON_VCORE_PC_POW_VCORE_PC_VG1: 1;
        uint32_t AON_LDO_DIG_POW_LDORET: 1;
        uint32_t AON_SWR_CORE_POW_SWR: 1;
        uint32_t AON_SWR_CORE_POW_LDO: 1;
        uint32_t AON_SWR_CORE_SEL_POS_VREFLPPFM: 1;
        uint32_t AON_SWR_CORE_FPWM_2: 1;
        uint32_t AON_SWR_CORE_TUNE_VDIV: 8;
        uint32_t AON_SWR_CORE_TUNE_POS_VREFPFM: 8;
        uint32_t AON_SWR_CORE_TUNE_REF_VREFLPPFM: 4;
    };
} AON_RG2X_TYPE;

/* 0xC      0x4000_000c
    1:0     R/W AON_REG3X_DUMMY1                2'h0        BTAON_reg_wr
    2       R/W AON_RFC_STORE                   1'b0        BTAON_reg_wr
    3       R/W AON_PF_STORE                    1'b0        BTAON_reg_wr
    4       R/W AON_MODEM_STORE                 1'b0        BTAON_reg_wr
    5       R/W AON_DP_MODEM_STORE              1'b0        BTAON_reg_wr
    6       R/W AON_BZ_STORE                    1'b0        BTAON_reg_wr
    7       R/W AON_BLE_STORE                   1'b0        BTAON_reg_wr
    8       R/W AON_BT_CORE_RSTB                1'b0        BTAON_reg_wr
    9       R/W AON_BT_PON_RSTB                 1'b0        BTAON_reg_wr
    10      R/W AON_ISO_BT_PON                  1'b1        BTAON_reg_wr
    11      R/W AON_ISO_BT_CORE                 1'b1        BTAON_reg_wr
    12      R/W AON_ISO_PLL2                    1'b1        BTAON_reg_wr
    13      R/W AON_ISO_PLL                     1'b1        BTAON_reg_wr
    14      R/W AON_BT_PLL_LP_PLL_pow_cpop      1'b0        BTAON_reg_wr
    15      R/W AON_BT_PLL_LP_PLL_pow_pll       1'b0        BTAON_reg_wr
    16      R/W AON_BT_PLL_pow_pll              1'b0        BTAON_reg_wr
    17      R/W AON_BT_PLL_LDO_pow_LDO          1'b0        BTAON_reg_wr
    18      R/W AON_BT_PLL_LDO_ERC_V12A_BTPLL   1'b0        BTAON_reg_wr
    19      R/W AON_BT_PLL_LDO_SW_LDO2PORCUT    1'b0        BTAON_reg_wr
    20      R/W AON_ISO_XTAL                    1'b1        BTAON_reg_wr
    21      R/W AON_OSC40M_POW_OSC              1'b1        BTAON_reg_wr
    24:22   R/W AON_XTAL_MODE                   3'b100      BTAON_reg_wr
    25      R/W AON_XTAL_POW_XTAL               1'b0        BTAON_reg_wr
    26      R/W AON_BT_RET_RSTB                 1'b1        BTAON_reg_wr
    27      R/W AON_RFC_RESTORE                 1'b0        BTAON_reg_wr
    28      R/W AON_PF_RESTORE                  1'b0        BTAON_reg_wr
    29      R/W AON_MODEM_RESTORE               1'b0        BTAON_reg_wr
    30      R/W AON_DP_MODEM_RESTORE            1'b0        BTAON_reg_wr
    31      R/W AON_BZ_RESTORE                  1'b0        BTAON_reg_wr
 */
typedef union _AON_RG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_REG3X_DUMMY1: 2;
        uint32_t AON_RFC_STORE: 1;
        uint32_t AON_PF_STORE: 1;
        uint32_t AON_MODEM_STORE: 1;
        uint32_t AON_DP_MODEM_STORE: 1;
        uint32_t AON_BZ_STORE: 1;
        uint32_t AON_BLE_STORE: 1;
        uint32_t AON_BT_CORE_RSTB: 1;
        uint32_t AON_BT_PON_RSTB: 1;
        uint32_t AON_ISO_BT_PON: 1;
        uint32_t AON_ISO_BT_CORE: 1;
        uint32_t AON_ISO_PLL2: 1;
        uint32_t AON_ISO_PLL: 1;
        uint32_t AON_BT_PLL_LP_PLL_pow_cpop: 1;
        uint32_t AON_BT_PLL_LP_PLL_pow_pll: 1;
        uint32_t AON_BT_PLL_pow_pll: 1;
        uint32_t AON_BT_PLL_LDO_pow_LDO: 1;
        uint32_t AON_BT_PLL_LDO_ERC_V12A_BTPLL: 1;
        uint32_t AON_BT_PLL_LDO_SW_LDO2PORCUT: 1;
        uint32_t AON_ISO_XTAL: 1;
        uint32_t AON_OSC40M_POW_OSC: 1;
        uint32_t AON_XTAL_MODE: 3;
        uint32_t AON_XTAL_POW_XTAL: 1;
        uint32_t AON_BT_RET_RSTB: 1;
        uint32_t AON_RFC_RESTORE: 1;
        uint32_t AON_PF_RESTORE: 1;
        uint32_t AON_MODEM_RESTORE: 1;
        uint32_t AON_DP_MODEM_RESTORE: 1;
        uint32_t AON_BZ_RESTORE: 1;
    };
} AON_RG3X_TYPE;

/* 0x10     0x4000_0010
    0       R/W FW_enter_lps                    1'b0        BTAON_reg_wr
    1       R/W FW_PON_SEQ_RST_N                1'b0        BTAON_reg_wr
    2       R/W true_power_off                  1'b0        BTAON_reg_wr
    3       R/W AON_RG4X_DUMMY3                 1'b0        BTAON_reg_wr
    4       R/W DPD_R[0]                        1'b1        BTAON_reg_wr
    5       R/W DPD_R[1]                        1'b0        BTAON_reg_wr
    6       R/W DPD_R[2]                        1'b1        BTAON_reg_wr
    7       R/W DPD_R[3]                        1'b1        BTAON_reg_wr
    8       R/W DPD_R[4]                        1'b1        BTAON_reg_wr
    9       R/W DPD_R[5]                        1'b1        BTAON_reg_wr
    10      R/W DPD_R[6]                        1'b1        BTAON_reg_wr
    11      R/W DPD_R[7]                        1'b1        BTAON_reg_wr
    12      R/W DPD_R[8]                        1'b1        BTAON_reg_wr
    13      R/W DPD_RCK                         1'b0        BTAON_reg_wr
    14      R/W AON_GATED_EN                    1'b1        BTAON_reg_wr
    15      R/W AON_RG4X_DUMMY15                1'b0        BTAON_reg_wr
    16      R/W AON_RG4X_DUMMY16                1'b0        BTAON_reg_wr
    17      R/W AON_RG4X_DUMMY17                1'b0        BTAON_reg_wr
    18      R/W AON_RG4X_DUMMY18                1'b0        BTAON_reg_wr
    19      R/W AON_RG4X_DUMMY19                1'b0        BTAON_reg_wr
    20      R/W AON_RG4X_DUMMY20                1'b0        BTAON_reg_wr
    21      R/W AON_RG4X_DUMMY21                1'b0        BTAON_reg_wr
    22      R/W AON_RG4X_DUMMY22                1'b0        BTAON_reg_wr
    23      R/W AON_RG4X_DUMMY23                1'b0        BTAON_reg_wr
    24      R/W AON_RG4X_DUMMY24                1'b0        BTAON_reg_wr
    25      R/W AON_RG4X_DUMMY25                1'b0        BTAON_reg_wr
    26      R/W AON_RG4X_DUMMY26                1'b0        BTAON_reg_wr
    27      R/W AON_RG4X_DUMMY27                1'b0        BTAON_reg_wr
    28      R/W AON_RG4X_DUMMY28                1'b0        BTAON_reg_wr
    29      R/W AON_RG4X_DUMMY29                1'b0        BTAON_reg_wr
    30      R/W AON_RG4X_DUMMY30                1'b0        BTAON_reg_wr
    31      R/W ISO_VDDON_XTAL                  1'b1        BTAON_reg_wr
 */
typedef union _AON_RG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_enter_lps: 1;
        uint32_t FW_PON_SEQ_RST_N: 1;
        uint32_t true_power_off: 1;
        uint32_t AON_RG4X_DUMMY3: 1;
        uint32_t DPD_R_0: 1;
        uint32_t DPD_R_1: 1;
        uint32_t DPD_R_2: 1;
        uint32_t DPD_R_3: 1;
        uint32_t DPD_R_4: 1;
        uint32_t DPD_R_5: 1;
        uint32_t DPD_R_6: 1;
        uint32_t DPD_R_7: 1;
        uint32_t DPD_R_8: 1;
        uint32_t DPD_RCK: 1;
        uint32_t AON_GATED_EN: 1;
        uint32_t AON_RG4X_DUMMY15: 1;
        uint32_t AON_RG4X_DUMMY16: 1;
        uint32_t AON_RG4X_DUMMY17: 1;
        uint32_t AON_RG4X_DUMMY18: 1;
        uint32_t AON_RG4X_DUMMY19: 1;
        uint32_t AON_RG4X_DUMMY20: 1;
        uint32_t AON_RG4X_DUMMY21: 1;
        uint32_t AON_RG4X_DUMMY22: 1;
        uint32_t AON_RG4X_DUMMY23: 1;
        uint32_t AON_RG4X_DUMMY24: 1;
        uint32_t AON_RG4X_DUMMY25: 1;
        uint32_t AON_RG4X_DUMMY26: 1;
        uint32_t AON_RG4X_DUMMY27: 1;
        uint32_t AON_RG4X_DUMMY28: 1;
        uint32_t AON_RG4X_DUMMY29: 1;
        uint32_t AON_RG4X_DUMMY30: 1;
        uint32_t ISO_VDDON_XTAL: 1;
    };
} AON_RG4X_TYPE;

#define AON_FAST_0x0                        0x0
#define AON_FAST_REBOOT_SW_INFO0            0x2
#define AON_FAST_REBOOT_SW_INFO1            0x3
#define AON_FAST_DEBUG_PASSWORD             0x4
#define AON_FAST_0x6                        0x6
#define AON_FAST_0x8                        0x8
#define AON_FAST_0xA                        0xA
#define AON_FAST_0xC                        0xC
#define AON_FAST_0xE                        0xE
#define AON_FAST_0x10                       0x10
#define AON_FAST_0x12                       0x12
#define AON_FAST_0x14                       0x14
#define AON_FAST_0x16                       0x16
#define AON_FAST_0x1A                       0x1A
#define AON_FAST_0x20                       0x20
#define AON_FAST_0xA8                       0xA8
#define AON_FAST_0xAA                       0xAA
#define AON_FAST_0xC4                       0xC4
#define AON_FAST_0xF4                       0xF4
#define AON_FAST_0x120                      0x120
#define AON_FAST_0x122                      0x122
#define AON_FAST_WK_STATUS                  0x12C
#define AON_FAST_0x154                      0x154
#define AON_FAST_0x156                      0x156
#define AON_FAST_0x15E                      0x15E
#define AON_FAST_0x164                      0x164
#define AON_FAST_0x166                      0x166
#define AON_FAST_0x172                      0x172
#define AON_FAST_0x17A                      0x17A
#define AON_FAST_0x17C                      0x17C
#define AON_FAST_0x17E                      0x17E
#define AON_FAST_0x182                      0x182
#define AON_FAST_0x184                      0x184
#define AON_FAST_0x186                      0x186
#define AON_FAST_0x188                      0x188
#define AON_FAST_0x18A                      0x18A
#define AON_FAST_0x18C                      0x18C
#define AON_FAST_0x18E                      0x18E
#define AON_FAST_0x190                      0x190
#define AON_FAST_0x192                      0x192
#define AON_FAST_0x194                      0x194
#define AON_FAST_BOOT                       0x400
#define AON_FAST_REG1X_FW_GENERAL           0x402
#define AON_FAST_REG2X_FW_GENERAL           0x404
#define AON_FAST_REG3X_FW_GENERAL           0x406
#define AON_FAST_REG4X_FW_GENERAL           0x408
#define AON_FAST_REG5X_FW_GENERAL           0x40A
#define AON_FAST_REG6X_FW_GENERAL           0x40C
#define AON_FAST_REG7X_FW_GENERAL           0x40E
#define AON_FAST_REG8X_FW_GENERAL           0x410
#define AON_FAST_REG9X_FW_GENERAL           0x412
#define AON_FAST_REG10X_FW_GENERAL          0x414
#define AON_FAST_REF_RESISTANCE             0x416
#define AON_FAST_REG12X_FW_GENERAL          0x418
#define AON_FAST_REG13X_FW_GENERAL          0x41A
#define AON_FAST_REG14X_FW_GENERAL          0x41C
#define AON_FAST_REG15X_FW_GENERAL          0x41E
#define AON_FAST_REG16X_FW_GENERAL          0x420
#define AON_FAST_REG17X_FW_GENERAL          0x422
#define AON_FAST_RG0X_MEMORY                0x580
#define AON_FAST_RG1X_MEMORY                0x582
#define AON_FAST_REG_RAMROM_VSEL            0x584
#define AON_FAST_REG_ROM_MCU                0x586
#define AON_FAST_REG_ROM_DSP1_HV_LV         0x588
#define AON_FAST_REG_ROM_RFC                0x58A
#define AON_FAST_REG_RAM_RX2_HV             0x58C
#define AON_FAST_REG_RAM_RX2_LV             0x58E
#define AON_FAST_REG_RAM_RX2_CACHE_HV       0x590
#define AON_FAST_REG_RAM_RX2_CACHE_LV       0x592
#define AON_FAST_REG_RAM_BUF_HV             0x594
#define AON_FAST_REG_RAM_BUF_LV             0x596
#define AON_FAST_REG_RAM_SDIO               0x598
#define AON_FAST_REG_RAM_USB                0x59A
#define AON_FAST_REG_RAM_MAC_HV             0x59C
#define AON_FAST_REG_RAM_MAC_LV             0x59E
#define AON_FAST_REG_RAM_MDM_HV             0x5A0
#define AON_FAST_REG_RAM_MDM_LV             0x5A2
#define AON_FAST_REG_RAM_DSP1_HV            0x5A4
#define AON_FAST_REG_RAM_DSP1_LV            0x5A6
#define AON_FAST_REG_RAM_DATA_HV            0x5A8
#define AON_FAST_REG_RAM_DATA_LV            0x5AA
#define AON_FAST_REG_RAM_RFC_HV             0x5AC
#define AON_FAST_REG_RAM_RFC_LV             0x5AE
#define AON_FAST_SRAM_DS_ISO0_1             0x5B0
#define AON_FAST_SRAM_DS_ISO0_2             0x5B2
#define AON_FAST_SRAM_DS_ISO0_3             0x5B4
#define AON_FAST_SRAM_DS_ISO0_4             0x5B6
#define AON_FAST_SRAM_DS_ISO0_5             0x5B8
#define AON_FAST_SRAM_DS_ISO0_6             0x5BA
#define AON_FAST_SRAM_DS_ISO0_7             0x5BC
#define AON_FAST_SRAM_DS_ISO0_8             0x5BE
#define AON_FAST_SRAM_DS_ISO0_9             0x5C0
#define AON_FAST_SRAM_DS_ISO0_10            0x5C2
#define AON_FAST_SRAM_DS_ISO1_1             0x5C4
#define AON_FAST_SRAM_DS_ISO1_2             0x5C6
#define AON_FAST_SRAM_DS_ISO1_3             0x5C8
#define AON_FAST_SRAM_DS_ISO1_4             0x5CA
#define AON_FAST_SRAM_DS_ISO1_5             0x5CC
#define AON_FAST_SRAM_DS_ISO1_6             0x5CE
#define AON_FAST_SRAM_DS_ISO1_7             0x5D0
#define AON_FAST_SRAM_DS_ISO1_8             0x5D2
#define AON_FAST_SRAM_DS_ISO1_9             0x5D4
#define AON_FAST_SRAM_DS_ISO1_10            0x5D6
#define AON_FAST_SRAM_SD_ISO0_1             0x5D8
#define AON_FAST_SRAM_SD_ISO0_2             0x5DA
#define AON_FAST_SRAM_SD_ISO0_3             0x5DC
#define AON_FAST_SRAM_SD_ISO0_4             0x5DE
#define AON_FAST_SRAM_SD_ISO0_5             0x5E0
#define AON_FAST_SRAM_SD_ISO0_6             0x5E2
#define AON_FAST_SRAM_SD_ISO0_7             0x5E4
#define AON_FAST_SRAM_SD_ISO0_8             0x5E6
#define AON_FAST_SRAM_SD_ISO0_9             0x5E8
#define AON_FAST_SRAM_SD_ISO0_10            0x5EA
#define AON_FAST_SRAM_SD_ISO1_1             0x5EC
#define AON_FAST_SRAM_SD_ISO1_2             0x5EE
#define AON_FAST_SRAM_SD_ISO1_3             0x5F0
#define AON_FAST_SRAM_SD_ISO1_4             0x5F2
#define AON_FAST_SRAM_SD_ISO1_5             0x5F4
#define AON_FAST_SRAM_SD_ISO1_6             0x5F6
#define AON_FAST_SRAM_SD_ISO1_7             0x5F8
#define AON_FAST_SRAM_SD_ISO1_8             0x5FA
#define AON_FAST_SRAM_SD_ISO1_9             0x5FC
#define AON_FAST_SRAM_SD_ISO1_10            0x5FE
#define AON_FAST_ROM_LS_VCORE_1             0x600
#define AON_FAST_SRAM_LS_VCORE_1            0x602
#define AON_FAST_SRAM_RM3_ISO0_1            0x604
#define AON_FAST_SRAM_RM3_ISO0_2            0x606
#define AON_FAST_SRAM_RM3_ISO0_3            0x608
#define AON_FAST_SRAM_RM3_ISO0_4            0x60A
#define AON_FAST_SRAM_RM3_ISO0_5            0x60C
#define AON_FAST_SRAM_RM3_ISO0_6            0x60E
#define AON_FAST_SRAM_RM3_ISO0_7            0x610
#define AON_FAST_SRAM_RM3_ISO0_8            0x612
#define AON_FAST_SRAM_RM3_ISO0_9            0x614
#define AON_FAST_SRAM_RM3_ISO0_10           0x616
#define AON_FAST_SRAM_RM3_ISO1_1            0x618
#define AON_FAST_SRAM_RM3_ISO1_2            0x61A
#define AON_FAST_SRAM_RM3_ISO1_3            0x61C
#define AON_FAST_SRAM_RM3_ISO1_4            0x61E
#define AON_FAST_SRAM_RM3_ISO1_5            0x620
#define AON_FAST_SRAM_RM3_ISO1_6            0x622
#define AON_FAST_SRAM_RM3_ISO1_7            0x624
#define AON_FAST_SRAM_RM3_ISO1_8            0x626
#define AON_FAST_SRAM_RM3_ISO1_9            0x628
#define AON_FAST_REG0X_BTPLL_SYS            0x6F0
#define AON_FAST_REG1X_BTPLL_SYS            0x6F2
#define AON_FAST_REG2X_BTPLL_SYS            0x6F4
#define AON_FAST_REG3X_BTPLL_SYS            0x6F6
#define AON_FAST_REG0X_XTAL_OSC_SYS         0x6F8
#define AON_FAST_REG0X_RET_SYS              0x6FA
#define AON_FAST_REG0X_CORE_SYS             0x6FC
#define AON_FAST_REG1X_CORE_SYS             0x6FE
#define AON_FAST_REG2X_CORE_SYS             0x700
#define AON_FAST_REG3X_CORE_SYS             0x702
#define AON_FAST_REG4X_CORE_SYS             0x704
#define AON_FAST_REG0X_REG_MASK             0x706
#define AON_FAST_REG1X_REG_MASK             0x708
#define AON_FAST_REG0X_PMU_POS_CLK_MUX      0x70A
#define AON_FAST_REG0X_PMU_POS_SEL          0x70C
#define AON_FAST_REG1X_PMU_POS_SEL          0x70E
#define AON_FAST_REG2X_PMU_POS_SEL          0x710
#define AON_FAST_REG3X_PMU_POS_SEL          0x712
#define AON_FAST_REG4X_PMU_POS_SEL          0x714
#define AON_FAST_REG5X_PMU_POS_SEL          0x716
#define AON_FAST_REG6X_PMU_POS_SEL          0x718
#define AON_FAST_REG7X_PMU_POS_SEL          0x71A
#define AON_FAST_REG8X_PMU_POS_SEL          0x71C
#define AON_FAST_REG9X_PMU_POS_SEL          0x71E
#define AON_FAST_REG10X_PMU_POS_SEL         0x720
#define AON_FAST_REG11X_PMU_POS_SEL         0x722
#define AON_FAST_REG12X_PMU_POS_SEL         0x724
#define AON_FAST_REG0X_REG_FSM              0x726
#define AON_FAST_REG0X_CLK_SEL              0x728
#define AON_FAST_REG0X_REG_AON_LOADER       0x72A
#define AON_FAST_REG0X_REG_AON_WDT          0x72C
#define AON_FAST_REG0X_PAD_H3L1             0x742
#define AON_FAST_REG0X_PAD_CFG              0x744
#define AON_FAST_REG1X_PAD_CFG              0x746
#define AON_FAST_REG2X_PAD_CFG              0x748
#define AON_FAST_REG0X_PAD_STS              0x7EC
#define AON_FAST_REG1X_PAD_STS              0x7EE
#define AON_FAST_REG2X_PAD_STS              0x7F0
#define AON_FAST_REG3X_PAD_STS              0x7F2
#define AON_FAST_REG4X_PAD_STS              0x7F4
#define AON_FAST_REG5X_PAD_STS              0x7F6
#define AON_FAST_REG6X_PAD_STS              0x7F8
#define AON_FAST_AON_REG_LOP_PON_RG0X       0x800
#define AON_FAST_AON_REG_LOP_PON_RG1X       0x802
#define AON_FAST_AON_REG_LOP_PON_RG2X       0x804
#define AON_FAST_AON_REG_LOP_PON_RG3X       0x806
#define AON_FAST_AON_REG_LOP_PON_RG4X       0x808
#define AON_FAST_AON_REG_LOP_PON_RG5X       0x80A
#define AON_FAST_AON_REG_LOP_PON_RG6X       0x80C
#define AON_FAST_AON_REG_LOP_PON_RG7X       0x80E
#define AON_FAST_AON_REG_LOP_PON_RG8X       0x810
#define AON_FAST_AON_REG_LOP_PON_RG9X       0x812
#define AON_FAST_AON_REG_LOP_PON_RG10X      0x814
#define AON_FAST_AON_REG_LOP_PON_RG11X      0x816
#define AON_FAST_AON_REG_LOP_PON_RG12X      0x818
#define AON_FAST_AON_REG_LOP_PON_RG13X      0x81A
#define AON_FAST_AON_REG_LOP_PON_RG14X      0x81C
#define AON_FAST_AON_REG_LOP_PON_RG15X      0x81E
#define AON_FAST_AON_REG_LOP_PON_RG16X      0x820
#define AON_FAST_AON_REG_LOP_PON_RG17X      0x822
#define AON_FAST_AON_REG_LOP_PON_RG18X      0x824
#define AON_FAST_AON_REG_LOP_PON_RG19X      0x826
#define AON_FAST_AON_REG_LOP_PON_RG20X      0x828
#define AON_FAST_AON_REG_LOP_PON_RG21X      0x82A
#define AON_FAST_AON_REG_LOP_PON_RG22X      0x82C
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG0X 0x82E
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG1X 0x830
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG2X 0x832
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG3X 0x834
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG4X 0x836
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG5X 0x838
#define AON_FAST_AON_REG_LOP_PON_DELAY_RG6X 0x83A
#define AON_FAST_AON_REG_LOP_PON_ECO_RG0X   0x83C
#define AON_FAST_AON_REG_LOP_POF_RG0X       0x850
#define AON_FAST_AON_REG_LOP_POF_RG1X       0x852
#define AON_FAST_AON_REG_LOP_POF_RG2X       0x854
#define AON_FAST_AON_REG_LOP_POF_RG3X       0x856
#define AON_FAST_AON_REG_LOP_POF_RG4X       0x858
#define AON_FAST_AON_REG_LOP_POF_RG5X       0x85A
#define AON_FAST_AON_REG_LOP_POF_RG6X       0x85C
#define AON_FAST_AON_REG_LOP_POF_RG7X       0x85E
#define AON_FAST_AON_REG_LOP_POF_RG8X       0x860
#define AON_FAST_AON_REG_LOP_POF_RG9X       0x862
#define AON_FAST_AON_REG_LOP_POF_RG10X      0x864
#define AON_FAST_AON_REG_LOP_POF_RG11X      0x866
#define AON_FAST_AON_REG_LOP_POF_RG12X      0x868
#define AON_FAST_AON_REG_LOP_POF_RG13X      0x86A
#define AON_FAST_AON_REG_LOP_POF_RG14X      0x86C
#define AON_FAST_AON_REG_LOP_POF_RG15X      0x86E
#define AON_FAST_AON_REG_LOP_POF_RG16X      0x870
#define AON_FAST_AON_REG_LOP_POF_RG17X      0x872
#define AON_FAST_AON_REG_LOP_POF_RG18X      0x874
#define AON_FAST_AON_REG_LOP_POF_RG19X      0x876
#define AON_FAST_AON_REG_LOP_POF_RG20X      0x878
#define AON_FAST_AON_REG_LOP_POF_RG21X      0x87A
#define AON_FAST_AON_REG_LOP_POF_RG22X      0x87C
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG0X 0x87E
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG1X 0x880
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG2X 0x882
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG3X 0x884
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG4X 0x886
#define AON_FAST_AON_REG_LOP_POF_DELAY_RG5X 0x888
#define AON_FAST_AON_REG_LOP_POF_MISC       0x88A
#define AON_FAST_AON_REG_LOP_POF_ECO_RG0X   0x88C
#define AON_FAST_REG0X_WAIT_READY           0x8A0
#define AON_FAST_REG1X_WAIT_READY           0x8A2
#define AON_FAST_REG0X_WAIT_AON_CNT         0x8A4
#define AON_FAST_REG1X_WAIT_AON_CNT         0x8A6
#define AON_FAST_REG2X_WAIT_AON_CNT         0x8A8
#define AON_FAST_REG3X_WAIT_AON_CNT         0x8AA
#define AON_FAST_REG4X_WAIT_AON_CNT         0x8AC
#define AON_FAST_REG5X_WAIT_AON_CNT         0x8AE
#define AON_FAST_REG6X_WAIT_AON_CNT         0x8B0
#define AON_FAST_REG7X_WAIT_AON_CNT         0x8B2
#define AON_FAST_REG8X_WAIT_AON_CNT         0x8B4
#define AON_FAST_REG9X_WAIT_AON_CNT         0x8B6
#define AON_FAST_REG10X_WAIT_AON_CNT        0x8B8
#define AON_FAST_REG11X_WAIT_AON_CNT        0x8BA
#define AON_FAST_REG12X_WAIT_AON_CNT        0x8BC
#define AON_FAST_REG13X_WAIT_AON_CNT        0x8BE
#define AON_FAST_REG14X_WAIT_AON_CNT        0x8C0
#define AON_FAST_REG15X_WAIT_AON_CNT        0x8C2
#define AON_FAST_REG16X_WAIT_AON_CNT        0x8C4
#define AON_FAST_REG17X_WAIT_AON_CNT        0x8C6
#define AON_FAST_REG18X_WAIT_AON_CNT        0x8C8
#define AON_FAST_REG19X_WAIT_AON_CNT        0x8CA
#define AON_FAST_SET_WKEN_MISC              0x8CC
#define AON_FAST_SET_WKPOL_MISC             0x8CE
#define AON_FAST_RO_WK_REG0X                0x8D0
#define AON_FAST_SET_SHIP_MODE              0x8D2
#define AON_FAST_SET_PMU_DBG_MODE           0x8D4
#define AON_FAST_REG0X_32k                  0x8D6
#define AON_FAST_REG1X_32k                  0x8D8
#define AON_FAST_REG2X_32k                  0x8DA
#define AON_FAST_REG0X_300k                 0x8DC
#define AON_FAST_REG1X_300k                 0x8DE
#define AON_FAST_REG2X_300k                 0x8E0
#define AON_FAST_REG3X_300k                 0x8E2
#define AON_FAST_REG0X_ZCD                  0x8E4
#define AON_FAST_REG0X_ZCD_AUDIO            0x8E6
#define AON_FAST_AON_REG0X_MUX_SEL          0x940
#define AON_FAST_AON_REG1X_MUX_SEL          0x942
#define AON_FAST_AON_REG2X_MUX_SEL          0x944
#define AON_FAST_AON_REG3X_MUX_SEL          0x946
#define AON_FAST_AON_REG4X_MUX_SEL          0x948
#define AON_FAST_AON_REG5X_MUX_SEL          0x94A
#define AON_FAST_AON_REG6X_MUX_SEL          0x94C
#define AON_FAST_AON_REG7X_MUX_SEL          0x94E
#define AON_FAST_AON_REG8X_MUX_SEL          0x950
#define AON_FAST_AON_REG9X_MUX_SEL          0x952
#define AON_FAST_AON_REG10X_MUX_SEL         0x954
#define AON_FAST_AON_REG11X_MUX_SEL         0x956
#define AON_FAST_AON_REG12X_MUX_SEL         0x958
#define AON_FAST_CORE_MODULE_REG0X_MUX_SEL  0x95A
#define AON_FAST_FAON_READ_RG0X             0x970
#define AON_FAST_FAON_READ_RG1X             0x972
#define AON_FAST_FAON_READ_RG2X             0x974
#define AON_FAST_FAON_READ_RG3X             0x976
#define AON_FAST_FAON_READ_RG4X             0x978
#define AON_FAST_FAON_READ_RG5X             0x97A
#define AON_FAST_FAON_READ_RG6X             0x97C
#define AON_FAST_FAON_READ_RG7X             0x97E
#define AON_FAST_FAON_READ_RG8X             0x980
#define AON_FAST_FAON_READ_RG9X             0x982
#define AON_FAST_FAON_READ_RG10X            0x984
#define AON_FAST_FAON_READ_RG11X            0x986
#define AON_FAST_FAON_READ_RG12X            0x988
#define AON_FAST_FAON_READ_RG13X            0x98A
#define AON_FAST_FAON_READ_RG14X            0x98C
#define AON_FAST_FAON_READ_RG15X            0x98E
#define AON_FAST_FAON_READ_RG16X            0x990
#define AON_FAST_FAON_READ_RG17X            0x992
#define AON_FAST_FAON_READ_RG18X            0x994
#define AON_FAST_FAON_READ_RG19X            0x996
#define AON_FAST_FAON_READ_RG20X            0x998
#define AON_FAST_FAON_READ_RG21X            0x99A
#define AON_FAST_FAON_READ_RG22X            0x99C
#define AON_FAST_REG0X_MBIAS                0xC00
#define AON_FAST_REG1X_MBIAS                0xC02
#define AON_FAST_REG2X_MBIAS                0xC04
#define AON_FAST_REG3X_MBIAS                0xC06
#define AON_FAST_REG4X_MBIAS                0xC08
#define AON_FAST_REG5X_MBIAS                0xC0A
#define AON_FAST_REG6X_MBIAS                0xC0C
#define AON_FAST_REG7X_MBIAS                0xC0E
#define AON_FAST_REG8X_MBIAS                0xC10
#define AON_FAST_REG9X_MBIAS                0xC12
#define AON_FAST_REG10X_MBIAS               0xC14
#define AON_FAST_FLAG0X_MBIAS               0xC16
#define AON_FAST_FLAG1X_MBIAS               0xC18
#define AON_FAST_FLAG2X_MBIAS               0xC1A
#define AON_FAST_REG0X_LDOSYS               0xC80
#define AON_FAST_REG1X_LDOSYS               0xC82
#define AON_FAST_REG2X_LDOSYS               0xC84
#define AON_FAST_REG3X_LDOSYS               0xC86
#define AON_FAST_REG4X_LDOSYS               0xC88
#define AON_FAST_FLAG0X_LDOSYS              0xC8A
#define AON_FAST_REG0X_LDOAUX1              0xD50
#define AON_FAST_REG1X_LDOAUX1              0xD52
#define AON_FAST_REG2X_LDOAUX1              0xD54
#define AON_FAST_REG0X_LDO_DIG              0xE60
#define AON_FAST_REG1X_LDO_DIG              0xE62
#define AON_FAST_REG0X_VCORE_PC             0xEB0
#define AON_FAST_REG0X_CHG                  0x1000
#define AON_FAST_REG1X_CHG                  0x1002
#define AON_FAST_REG2X_CHG                  0x1004
#define AON_FAST_REG3X_CHG                  0x1006
#define AON_FAST_REG4X_CHG                  0x1008
#define AON_FAST_FLAG0X_CHG                 0x100A
#define AON_FAST_REG0X_SWR_CORE             0x1040
#define AON_FAST_REG1X_SWR_CORE             0x1042
#define AON_FAST_REG2X_SWR_CORE             0x1044
#define AON_FAST_REG3X_SWR_CORE             0x1046
#define AON_FAST_REG4X_SWR_CORE             0x1048
#define AON_FAST_REG5X_SWR_CORE             0x104A
#define AON_FAST_REG6X_SWR_CORE             0x104C
#define AON_FAST_REG7X_SWR_CORE             0x104E
#define AON_FAST_REG8X_SWR_CORE             0x1050
#define AON_FAST_REG9X_SWR_CORE             0x1052
#define AON_FAST_REG10X_SWR_CORE            0x1054
#define AON_FAST_FLAG0X_SWR_CORE            0x1056
#define AON_FAST_C_KOUT0X_SWR_CORE          0x1058
#define AON_FAST_C_KOUT1X_SWR_CORE          0x105A
#define AON_FAST_C_KOUT2X_SWR_CORE          0x105C
#define AON_FAST_REG0X_SWR_AUDIO            0x11C0
#define AON_FAST_REG1X_SWR_AUDIO            0x11C2
#define AON_FAST_REG2X_SWR_AUDIO            0x11C4
#define AON_FAST_REG3X_SWR_AUDIO            0x11C6
#define AON_FAST_REG4X_SWR_AUDIO            0x11C8
#define AON_FAST_REG5X_SWR_AUDIO            0x11CA
#define AON_FAST_REG6X_SWR_AUDIO            0x11CC
#define AON_FAST_REG7X_SWR_AUDIO            0x11CE
#define AON_FAST_REG8X_SWR_AUDIO            0x11D0
#define AON_FAST_REG9X_SWR_AUDIO            0x11D2
#define AON_FAST_REG10X_SWR_AUDIO           0x11D4
#define AON_FAST_FLAG0X_SWR_AUDIO           0x11D6
#define AON_FAST_C_KOUT0X_SWR_AUDIO         0x11D8
#define AON_FAST_C_KOUT1X_SWR_AUDIO         0x11DA
#define AON_FAST_C_KOUT2X_SWR_AUDIO         0x11DC
#define AON_FAST_REG_BT_ANAPAR_PLL0         0x1400
#define AON_FAST_REG_BT_ANAPAR_PLL1         0x1402
#define AON_FAST_REG_BT_ANAPAR_PLL2         0x1404
#define AON_FAST_REG_BT_ANAPAR_PLL3         0x1406
#define AON_FAST_REG_BT_ANAPAR_PLL4         0x1408
#define AON_FAST_REG_BT_ANAPAR_PLL5         0x140A
#define AON_FAST_REG_BT_ANAPAR_LDO_PLL0     0x140C
#define AON_FAST_RG0X_32KXTAL               0x1470
#define AON_FAST_RG1X_32KXTAL               0x1472
#define AON_FAST_RG2X_32KXTAL               0x1474
#define AON_FAST_RG0X_32KOSC                0x1476
#define AON_FAST_RG0X_POW_32K               0x1478
#define AON_FAST_BT_ANAPAR_XTAL_mode        0x1490
#define AON_FAST_BT_ANAPAR_XTAL0            0x1492
#define AON_FAST_BT_ANAPAR_XTAL1            0x1494
#define AON_FAST_BT_ANAPAR_XTAL2            0x1496
#define AON_FAST_BT_ANAPAR_XTAL3            0x1498
#define AON_FAST_BT_ANAPAR_XTAL4            0x149A
#define AON_FAST_BT_ANAPAR_XTAL5            0x149C
#define AON_FAST_BT_ANAPAR_XTAL6            0x149E
#define AON_FAST_BT_ANAPAR_XTAL7            0x14A0
#define AON_FAST_BT_ANAPAR_XTAL8            0x14A2
#define AON_FAST_BT_ANAPAR_XTAL9            0x14A4
#define AON_FAST_BT_ANAPAR_XTAL10           0x14A6
#define AON_FAST_BT_ANAPAR_XTAL11           0x14A8
#define AON_FAST_BT_ANAPAR_XTAL12           0x14AA
#define AON_FAST_BT_ANAPAR_XTAL13           0x14AC
#define AON_FAST_BT_ANAPAR_XTAL14           0x14AE
#define AON_FAST_BT_ANAPAR_XTAL15           0x14B0
#define AON_FAST_BT_ANAPAR_XTAL16           0x14B2
#define AON_FAST_BT_ANAPAR_XTAL17           0x14B4
#define AON_FAST_BT_ANAPAR_OSC40M           0x14F0
#define AON_FAST_REG0X_AUXADC               0x1510
#define AON_FAST_REG1X_AUXADC               0x1512
#define AON_FAST_REG2X_AUXADC               0x1514
#define AON_FAST_REG3X_AUXADC               0x1516
#define AON_FAST_REG4X_AUXADC               0x1518
#define AON_FAST_REG5X_AUXADC               0x151A
#define AON_FAST_REG6X_AUXADC               0x151C
#define AON_FAST_RG0X_CODEC_LDO             0x1530
#define AON_FAST_REG0X_BTADDA_LDO           0x1540
#define AON_FAST_REG0X_USB                  0x1550
#define AON_FAST_REG0X_PAD_ADC_0            0x1560
#define AON_FAST_REG1X_PAD_ADC_1            0x1562
#define AON_FAST_REG2X_PAD_ADC_2            0x1564
#define AON_FAST_REG3X_PAD_ADC_3            0x1566
#define AON_FAST_REG0X_PAD_P1_0             0x1568
#define AON_FAST_REG1X_PAD_P1_1             0x156A
#define AON_FAST_REG2X_PAD_P1_2             0x156C
#define AON_FAST_REG3X_PAD_P1_3             0x156E
#define AON_FAST_REG4X_PAD_P1_4             0x1570
#define AON_FAST_REG5X_PAD_P1_5             0x1572
#define AON_FAST_REG6X_PAD_P1_6             0x1574
#define AON_FAST_REG7X_PAD_P1_7             0x1576
#define AON_FAST_REG0X_PAD_P2_0             0x1578
#define AON_FAST_REG1X_PAD_P2_1             0x157A
#define AON_FAST_REG2X_PAD_P2_2             0x157C
#define AON_FAST_REG3X_PAD_P2_3             0x157E
#define AON_FAST_REG4X_PAD_P2_4             0x1580
#define AON_FAST_REG5X_PAD_P2_5             0x1582
#define AON_FAST_REG6X_PAD_P2_6             0x1584
#define AON_FAST_REG7X_PAD_P2_7             0x1586
#define AON_FAST_REG0X_PAD_P3_0             0x1588
#define AON_FAST_REG1X_PAD_P3_1             0x158A
#define AON_FAST_REG2X_PAD_P3_2             0x158C
#define AON_FAST_REG3X_PAD_P3_3             0x158E
#define AON_FAST_REG4X_PAD_P3_4             0x1590
#define AON_FAST_REG5X_PAD_P3_5             0x1592
#define AON_FAST_REG0X_PAD_P4_0             0x1594
#define AON_FAST_REG1X_PAD_P4_1             0x1596
#define AON_FAST_REG2X_PAD_P4_2             0x1598
#define AON_FAST_REG3X_PAD_P4_3             0x159A
#define AON_FAST_REG4X_PAD_P4_4             0x159C
#define AON_FAST_REG5X_PAD_P4_5             0x159E
#define AON_FAST_REG6X_PAD_P4_6             0x15A0
#define AON_FAST_REG7X_PAD_P4_7             0x15A2
#define AON_FAST_REG0X_PAD_P5_0             0x15A4
#define AON_FAST_REG1X_PAD_P5_1             0x15A6
#define AON_FAST_REG2X_PAD_P5_2             0x15A8
#define AON_FAST_REG3X_PAD_P5_3             0x15AA
#define AON_FAST_REG4X_PAD_P5_4             0x15AC
#define AON_FAST_REG5X_PAD_P5_5             0x15AE
#define AON_FAST_REG6X_PAD_P5_6             0x15B0
#define AON_FAST_REG7X_PAD_P5_7             0x15B2
#define AON_FAST_REG0X_PAD_P6_0             0x15B4
#define AON_FAST_REG1X_PAD_P6_1             0x15B6
#define AON_FAST_REG2X_PAD_P6_2             0x15B8
#define AON_FAST_REG3X_PAD_P6_3             0x15BA
#define AON_FAST_REG4X_PAD_P6_4             0x15BC
#define AON_FAST_REG5X_PAD_P6_5             0x15BE
#define AON_FAST_REG6X_PAD_P6_6             0x15C0
#define AON_FAST_REG0X_PAD_P7_0             0x15C2
#define AON_FAST_REG1X_PAD_P7_1             0x15C4
#define AON_FAST_REG2X_PAD_P7_2             0x15C6
#define AON_FAST_REG3X_PAD_P7_3             0x15C8
#define AON_FAST_REG4X_PAD_P7_4             0x15CA
#define AON_FAST_REG5X_PAD_P7_5             0x15CC
#define AON_FAST_REG6X_PAD_P7_6             0x15CE
#define AON_FAST_REG0X_PAD_P8_0             0x15D0
#define AON_FAST_REG1X_PAD_P8_1             0x15D2
#define AON_FAST_REG2X_PAD_P8_2             0x15D4
#define AON_FAST_REG3X_PAD_P8_3             0x15D6
#define AON_FAST_REG4X_PAD_P8_4             0x15D8
#define AON_FAST_REG5X_PAD_P8_5             0x15DA
#define AON_FAST_REG0X_PAD_SPIC0_CSN        0x15DC
#define AON_FAST_REG1X_PAD_SPIC0_SCK        0x15DE
#define AON_FAST_REG2X_PAD_SPIC0_SIO0       0x15E0
#define AON_FAST_REG3X_PAD_SPIC0_SIO1       0x15E2
#define AON_FAST_REG4X_PAD_SPIC0_SIO2       0x15E4
#define AON_FAST_REG5X_PAD_SPIC0_SIO3       0x15E6
#define AON_FAST_REG0X_PAD_SPIC1_CSN        0x15E8
#define AON_FAST_REG1X_PAD_SPIC1_SCK        0x15EA
#define AON_FAST_REG2X_PAD_SPIC1_SIO0       0x15EC
#define AON_FAST_REG3X_PAD_SPIC1_SIO1       0x15EE
#define AON_FAST_REG4X_PAD_SPIC1_SIO2       0x15F0
#define AON_FAST_REG5X_PAD_SPIC1_SIO3       0x15F2
#define AON_FAST_REG0X_PAD_SPIC2_CSN        0x15F4
#define AON_FAST_REG1X_PAD_SPIC2_SCK        0x15F6
#define AON_FAST_REG2X_PAD_SPIC2_SIO0       0x15F8
#define AON_FAST_REG3X_PAD_SPIC2_SIO1       0x15FA
#define AON_FAST_REG4X_PAD_SPIC2_SIO2       0x15FC
#define AON_FAST_REG5X_PAD_SPIC2_SIO3       0x15FE
#define AON_FAST_REG0X_PAD_MIC1_P           0x1600
#define AON_FAST_REG1X_PAD_MIC1_N           0x1602
#define AON_FAST_REG2X_PAD_MIC2_P           0x1604
#define AON_FAST_REG3X_PAD_MIC2_N           0x1606
#define AON_FAST_REG4X_PAD_MIC3_P           0x1608
#define AON_FAST_REG5X_PAD_MIC3_N           0x160A
#define AON_FAST_REG6X_PAD_LOUT_P           0x160C
#define AON_FAST_REG7X_PAD_LOUT_N           0x160E
#define AON_FAST_REG8X_PAD_ROUT_P           0x1610
#define AON_FAST_REG9X_PAD_ROUT_N           0x1612
#define AON_FAST_REG10X_PAD_AUX_L           0x1614
#define AON_FAST_REG11X_PAD_AUX_R           0x1616
#define AON_FAST_REG12X_PAD_MICBIAS         0x1618
#define AON_FAST_REG0X_PAD_P10_0            0x161A

/* 0x0
    15:00   R/W freg0                                            16'b0
 */
typedef union _AON_FAST_0x0_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg0: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x0_TYPE;

/* 0x02 (AON_FAST_REBOOT_SW_INFO0, AON_FAST_REBOOT_SW_INFO1) */
typedef union _AON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t ota_valid: 1;                  /* bit[0]: ota valid */
        uint16_t is_rom_code_patch: 1;          /* bit[1]: is rom code patch ? */
        uint16_t is_fw_trig_wdg_to: 1;          /* bit[2]: does fw trigger watchdog timeout ? */
        uint16_t is_airplane_mode: 1;           /* bit[3]: does h5 link reset ? */
        uint16_t is_send_patch_end_evt: 1;      /* bit[4]: does we send patch end event ? */
        uint16_t ota_mode: 1;                   /* bit[5]: ota mode */
        uint16_t is_hci_mode: 1;                /* bit[6]: switch to hci mode? */
        uint16_t is_single_tone_mode: 1;        /* bit[7]: reserved */
        uint16_t REBOOT_SW_INFO1: 8;            /* bit[15:08] for AON_FAST_REBOOT_SW_INFO1 */
    };
} AON_FAST_REBOOT_SW_INFO0_TYPE;

/* 0x4
    15:00   R/W freg2                                            16'b0
 */
typedef union _AON_FAST_0x4_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg2: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x4_TYPE;

/* 0x6
    15:00   R/W freg3                                            16'h0
 */
typedef union _AON_FAST_0x6_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg3: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x6_TYPE;

/* 0x8
    15:00   R/W freg4                                            16'h0
 */
typedef union _AON_FAST_0x8_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg4: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x8_TYPE;

/* 0xA
    15:00   R/W freg5                                            16'h0
 */
typedef union _AON_FAST_0xA_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg5: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0xA_TYPE;

/* 0xC
    15:00   R/W freg6                                            16'h0
 */
typedef union _AON_FAST_0xC_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg6: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0xC_TYPE;

/* 0xE
    15:00   R/W freg7                                            16'h0
 */
typedef union _AON_FAST_0xE_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg7: 16;                 /* FW reserved registers. */
    };
} AON_FAST_0x0E_TYPE;

/* 0x10
    15:00   R/W freg8                                            16'h0
 */
typedef union _AON_FAST_0x10_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg8: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x10_TYPE;

/* 0x12
    15:00   R/W freg9                                            16'h0
 */
typedef union _AON_FAST_0x12_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg9: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x12_TYPE;

/* 0x14
    15:00   R/W freg10                                            16'h0
 */
typedef union _AON_FAST_0x14_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg10: 8;                   /* FW reserved registers. */
        uint16_t wdg_reset_reason_lsb: 3;
        uint16_t rsvd1:                2;
        uint16_t wdg_reset_reason_msb: 3;
    };
} AON_FAST_0x14_TYPE;

/* 0x16
    15:00   R/W freg11                                            16'h0
 */
typedef union _AON_FAST_0x16_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t freg11: 16;                   /* FW reserved registers. */
    };
} AON_FAST_0x16_TYPE;

/* 0x1A
    05:00   R   RSVD
    10:06   R/W ECO_D_023_REVERSE_4_0
    11      R/W reg_aon_w1o_clk_flash_dis
    15:12   R/W XTAL32K_Reserved15_9_6
 */
typedef union _AON_FAST_0x1A_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t RCAL_5_0: 6;                           // 05:00
        uint16_t rsvd0: 5;                              // 10:06
        uint16_t reg_aon_flash_clk_dis: 1;              // 11
        uint16_t is_efuse_invalid: 1;                   // 12
        uint16_t is_enable_efuse_read_protect: 1;       // 13
        uint16_t is_enable_efuse_write_protect: 1;      // 14
        uint16_t is_hw_aes_dma_mode: 1;                 // 15
    };
} AON_FAST_0x1A_TYPE;

/* 0x20
    0       R   POW_32KXTAL
    1       R   POW_32KOSC
    2       R/W reg_dsp_flash_prot
    3       R/W reg_aon_hwspi_en_wp
    4       R/W reg_aon_hwspi_en
    5       R/W reg_aon_debug_port_wp
    6       R/W reg_aon_debug_port
    7       R/W reg_aon_dbg_boot_dis
    15:08   R/W XTAL32K_Reserved16_13_6
 */
typedef union _AON_FAST_0x20_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t POW_32KXTAL: 1;
        uint16_t POW_32KOSC: 1;
        uint16_t reg_dsp_flash_prot: 1;
        uint16_t reg_aon_hwspi_en_wp: 1;
        uint16_t reg_aon_hwspi_en: 1;
        uint16_t reg_aon_debug_port_wp: 1;
        uint16_t reg_aon_debug_port: 1;
        uint16_t reg_aon_dbg_boot_dis: 1;
        uint16_t is_disable_hci_ram_patch: 1;           // 08
        uint16_t is_disable_hci_flash_access: 1;        // 09
        uint16_t is_disable_hci_system_access: 1;       // 10
        uint16_t is_disable_hci_efuse_access: 1;        // 11
        uint16_t is_disable_hci_bt_test: 1;             // 12
        uint16_t is_disable_usb_function: 1;            // 13
        uint16_t is_disable_sdio_function: 1;           // 14
        uint16_t is_debug_password_invalid: 1;          // 15
    };
} AON_FAST_0x20_TYPE;

/* 0xA8
*/
typedef union _AON_FAST_0xA8_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t XTAL_FREQ_SEL: 3;             // 02:00
        uint16_t AAC_SEL: 1;                   // 03
        uint16_t AAC_GM1: 6;                   // 09:04
        uint16_t AAC_GM: 6;                    // 15:10
    };
} AON_FAST_0xA8_TYPE;

/* 0xAA
*/
typedef union _AON_FAST_0xAA_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 15;                     // 14:00
        uint16_t RCAL_32K_SEL: 1;              // 15
    };
} AON_FAST_0xAA_TYPE;

/* 0xC4
    07:00   rw  RSVD                            8'h0
    15:08   r   XTAL_IS_FINEO                   8'h0
 */
typedef union _AON_FAST_0xC4_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t RSVD: 8;
        uint16_t XTAL_IS_FINEO: 8;
    };
} AON_FAST_0xC4_TYPE;

/* 0xF4
*/
typedef union _AON_FAST_0xF4_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 1;                      // 00
        uint16_t rsvd1: 1;                     // 01
        uint16_t BRWN_OUT_GATING: 1;           // 02
        uint16_t BRWN_OUT_RESET: 1;            // 03
        uint16_t rsvd2: 7;                     // 10:04
        uint16_t AON_DBG_SEL: 5;               // 15:11
    };
} AON_FAST_0xF4_TYPE;


/* 0x120
*/
typedef union _AON_FAST_0x120_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t PAD_ROUT_N_ANA_MODE: 1;             // 00
        uint16_t PAD_ROUT_P_ANA_MODE: 1;             // 01
        uint16_t PAD_LOUT_N_ANA_MODE: 1;             // 02
        uint16_t PAD_LOUT_P_ANA_MODE: 1;             // 03
        uint16_t PAD_MIC2_N_ANA_MODE: 1;             // 04
        uint16_t PAD_MIC2_P_ANA_MODE: 1;             // 05
        uint16_t PAD_MIC1_N_ANA_MODE: 1;             // 06
        uint16_t PAD_MIC1_P_ANA_MODE: 1;             // 07
        uint16_t rsvd: 8;                            // 15:08
    };
} AON_FAST_0x120_TYPE;

/* 0x122
*/
typedef union _AON_FAST_0x122_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 13;                          // 12:00
        uint16_t PAD_MICBIAS_ANA_MODE: 1;           // 13
        uint16_t PAD_AUX_R_ANA_MODE: 1;             // 14
        uint16_t PAD_AUX_L_ANA_MODE: 1;             // 15
    };
} AON_FAST_0x122_TYPE;


/* 0x12C
*/
typedef union _AON_FAST_WK_STATUS_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 6;                      // 05:00
        uint16_t brwn_int_en: 1;               // 06
        uint16_t brwn_int_pol: 1;              // 07
        uint16_t brwn_det_intr: 1;             // 08
        uint16_t wakeup_blk_ind: 1;            // 09
        uint16_t PAD_P2_0_I: 1;                // 10
        uint16_t PAD_BOOT_FROM_FLASH_I: 1;     // 11
        uint16_t rsvd1: 4;                     // 15:12
    };
} AON_FAST_WK_STATUS_TYPE;

/* 0x154
*/
typedef union _AON_FAST_0x154_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 8;                 // 07:00
        uint16_t lp_xtal_sel: 2;          // 09:08
        uint16_t swr_ss_lpf_out: 6;       // 15:10
    };
} AON_FAST_0x154_TYPE;

/* 0x156
*/
typedef union _AON_FAST_0x156_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t lp_xtal_ppm_err: 6;           // 05:00
        uint16_t lp_xtal_ppm_plus: 1;          // 06
        uint16_t rsvd: 1;                      // 07
        uint16_t aon_dbgo_8_for_aon_clk: 1;    // 08
        uint16_t rsvd1: 6;                     // 14:09
        uint16_t en_ldo_pa_switch: 1;          // 15
    };
} AON_FAST_0x156_TYPE;

/* 0x15E
*/
typedef union _AON_FAST_0x15E_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 3;                     // 02:00
        uint16_t MAC_TX_ON_PA_DL: 1;          // 03
        uint16_t quick_wakeup: 1;             // 04
        uint16_t rsvd1: 3;                    // 15:05
    };
} AON_FAST_0x15E_TYPE;

/* 0x164
*/
typedef union _AON_FAST_0x164_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 1;                       // 00
        uint16_t rsvd1: 1;                      // 01
        uint16_t r_PMUX_SCAN_FT_2_EN: 1;        // 02
        uint16_t r_PMUX_SCAN_FT_EN: 1;          // 03
        uint16_t r_PMUX_SCAN_FT_2_EN_src: 1;    // 04
        uint16_t r_PMUX_SCAN_FT_EN_src: 1;      // 05
        uint16_t r_PMUX_SCAN_MODE_EN: 1;        // 06
        uint16_t rsvd2: 1;                      // 07
        uint16_t rsvd3: 1;                      // 08
        uint16_t rsvd4: 5;                      // 13:09
        uint16_t PAD_MIC3_N_ANA_MODE: 1;        // 14
        uint16_t PAD_MIC3_P_ANA_MODE: 1;        // 15
    };
} AON_FAST_0x164_TYPE;

/* 0x166
*/
typedef union _AON_FAST_0x166_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t XPDCK_VREF_OUT: 5;             // 04:00
        uint16_t XPDCK_READY: 1;                // 05
        uint16_t XPDCK_BUSY: 1;                 // 06
        uint16_t dummy: 1;                      // 07
        uint16_t XTAL_PDCK_LP: 1;               // 12:08
        uint16_t XTAL_PDCK_OK: 1;               // 13
        uint16_t XTAL_PDCK_BUSY: 1;             // 14
        uint16_t xtal_pdck_rslt_latch: 1;       // 15
    };
} AON_FAST_0x166_TYPE;

/* 0x172
*/
typedef union _AON_FAST_0x172_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd: 1;                   // 00
        uint16_t r_clk_cpu_tick_sel: 1;     // 01
        uint16_t rsvd1: 14;                 // 15:02
    };
} AON_FAST_0x172_TYPE;


/* 0x17A
*/
typedef union _AON_FAST_0x17A_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t EFUSE_RP_LOCK: 2;              // 01:00
        uint16_t EFUSE_WP_LOCK: 2;              // 03:02
        uint16_t EFUSE_RP_EN: 2;                // 05:04
        uint16_t EFUSE_WP_EN: 2;                // 07:06
        uint16_t reg_aon_w1o_gpr_0: 8;          // 15:08
    };
} AON_FAST_0x17A_TYPE;

/* 0x17C
*/
typedef union _AON_FAST_0x17C_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t reg_aon_w1o_gpr_1: 16;         // 15:00
    };
} AON_FAST_0x17C_TYPE;

/* 0x17E
*/
typedef union _AON_FAST_0x17E_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t reg_anc_ff_en_wp: 1;               // 00
        uint16_t reg_anc_fb_en_wp: 1;               // 01
        uint16_t reg_anc_fbpn_en_wp: 1;             // 02
        uint16_t reg_anc_lms_en_wp: 1;              // 03
        uint16_t sel_swr_ss_top: 1;                 // 04
        uint16_t rsvd: 11;                          // 15:05
    };
} AON_FAST_0x17E_TYPE;

/* 0x184
*/
typedef union _AON_FAST_0x184_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t REG_194_w1o_B7toB0: 8;                 // 07:00
        uint16_t reg_aon_w1o_bt4_func_dis: 1;           // 08
        uint16_t reg_aon_w1o_bt2_func_dis: 1;           // 09
        uint16_t reg_aon_w1o_handover_func_dis: 1;      // 10
        uint16_t reg_aon_w1o_sniff2_func_dis: 1;        // 11
        uint16_t reg_aon_w1o_sniff1_func_dis: 1;        // 12
        uint16_t reg_aon_w1o_sniff_half_slot_dis: 1;    // 13
        uint16_t reg_aon_w1o_fir_dis: 1;                // 14
        uint16_t rsvd: 1;                               // 15
    };
} AON_FAST_0x184_TYPE;

/* 0x186
*/
typedef union _AON_FAST_0x186_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t reg_anc_io_en_wp: 8;         // 07:00
        uint16_t reg_anc_inst_rp: 1;          // 08
        uint16_t reg_anc_para_rp: 1;          // 09
        uint16_t reg_anc_w1o_spk1_dis: 1;     // 10
        uint16_t reg_anc_w1o_spk2_dis: 1;     // 11
        uint16_t reg_anc_w1o_mic1_dis: 1;     // 12
        uint16_t reg_anc_w1o_mic2_dis: 1;     // 13
        uint16_t reg_anc_w1o_mic3_dis: 1;     // 14
        uint16_t reg_anc_w1o_mic4_dis: 1;     // 15
    };
} AON_FAST_0x186_TYPE;

/* 0x188
*/
typedef union _AON_FAST_0x188_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t cpu_pc_15_0: 16;         // 15:00
    };
} AON_FAST_0x188_TYPE;

/* 0x18A
*/
typedef union _AON_FAST_0x18A_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t cpu_pc_31_16: 16;         // 15:00
    };
} AON_FAST_0x18A_TYPE;

/* 0x18C
*/
typedef union _AON_FAST_0x18C_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t cpu_lr_15_0: 16;         // 15:00
    };
} AON_FAST_0x18C_TYPE;


/* 0x18E
*/
typedef union _AON_FAST_0x18E_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t cpu_lr_31_16: 16;         // 15:00
    };
} AON_FAST_0x18E_TYPE;


/* 0x190
*/
typedef union _AON_FAST_0x190_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t cpu_psr_15_0: 16;         // 15:00
    };
} AON_FAST_0x190_TYPE;

/* 0x192
*/
typedef union _AON_FAST_0x192_TYPE
{
    uint16_t d16;
    struct
